---
kind: type
id: T:Autodesk.Revit.DB.PerformanceAdviserRules
source: html/93aa4c7f-87ec-94d5-9846-5acd86954011.htm
---
# Autodesk.Revit.DB.PerformanceAdviserRules

Provides a container of all Revit built-in PerformanceAdviserRuleId instances.

## Syntax (C#)
```csharp
public static class PerformanceAdviserRules
```